{
  "data": {
    "游戏机制": [
      {
        "title": "全部专精（职业）",
        "md": "![image](https://z3.ax1x.com/2021/06/28/Rt6Yxs.png)\n\n### 风暴专精（Storm Mastery）\n\n单一专精：风暴召唤者（Stormcaller）\n\n　　+大地专精：元素师（Elementalist）\n\n　　+战斗专精：领主（Thane）\n\n　　+死灵专精：神使（Oracle）\n\n　　+防御专精：圣武士（Paladin）\n\n　　+自然专精：德鲁伊（Druid）\n\n　　+狩猎专精：贤者（Sage）\n\n　　+盗贼专精：术士（Sorcerer）\n\n　　+符文专精：雷吼者（Thunderer）\n\n### 大地专精（Earth Mastery）\n\n　　单一专精：火占师（Pyromancer）\n\n　　+战斗专精：战法师（Battlemage）\n\n　　+死灵专精：妖术师（Conjurer）\n\n　　+防御专精：主宰者（Juggernaut）\n\n　　+自然专精：召唤者（Summoner）\n\n　　+狩猎专精：复仇者（Avenger）\n\n　　+盗贼专精：魔术师（Magician）\n\n　　+符文专精：石语者（Stonespeaker）\n\n### 战斗专精（Warfare Mastery）\n\n　　单一专精：战士（Warrior）\n\n　　+死灵专精：破法士（Spellbreaker）\n\n　　+防御专精：征服者（Conqueror）\n\n　　+自然专精：斗士（Champion）\n\n　　+狩猎专精：屠宰者（Slayer）\n\n　　+盗贼专精：刺客（Assassin）\n\n　　+符文专精：狂战士（Berserker）\n\n### 死灵专精（Spirit Mastery）\n\n　　单一专精：巫术师（Theurgist）\n\n　　+防御专精：演说家（Spellbinder）\n\n　　+自然专精：预言家（Soothsayer）\n\n　　+狩猎专精：骷髅巫师（Bone Charmer）\n\n　　+盗贼专精：法术士（Warlock）\n\n　　+符文专精：萨满（Shaman）\n\n### 防御专精（Defense Mastery）\n\n　　单一专精：防御者（Defender）\n\n　　+自然专精：保护者（Guardian）\n\n　　+狩猎专精：看守者（Warden）\n\n　　+盗贼专精：海盗（Corsair）\n\n　　+符文专精：符文铁匠（Runesmith）\n\n### 自然专精（Nature Mastery）\n\n　　单一专精：漫游者（Wanderer）\n\n　　+狩猎专精：巡林客（Ranger）\n\n　　+盗贼专精：幻术家（Illusionist）\n\n　　+符文专精：易形者（Skinchanger）\n\n### 狩猎专精（Hunting Mastery）\n\n　　单一专精：猎人（Hunter）\n\n　　+盗贼专精：强盗（Brigand）\n\n　　+符文专精：猎龙者（Dragonhunter）\n\n### 盗贼专精（Rogue Mastery）\n\n　　单一专精：盗贼（Rogue）\n\n　　+符文专精：魔法师（Trickster）\n\n### 符文专精贼专精（Runemaster Mastery）\n\n　　单一专精：符文大师（Runemaster）"
      },
      {
        "title": "奖励永久属性的支线",
        "md": "### 第一幕\n1. 被毒害的源泉\n    - 奖励：生命值\n    - 初始任务NPC 奥罗鲁斯~年轻的特戈亚人（泰耶阿）\n    - 任务后续/完成NPC 帊姬亚~水仙女 （泰耶阿森林）\n2. 特定的祭品\n    - 奖励：抗性\n    - 初始任务NPC 泰门~麦加拉执政官 （麦加拉城）\n    - 后续任务NPC 伊雷迪穆斯~奥利夫农夫 （何里克斯山口)\n    - 交任务的NPC 艾斯提奥兹~神殿侍者（特尔婓城）\n3. 一个好人马\n    - 奖励 2属性点\n    - 任务初始/完成 NPC 凯尔戎~半人马贵族 （埃博若斯厄丝农场）\n\n![image](https://img.99danji.com/uploadfile/2016/1211/20161211113203649.jpg)\n\n### 第二幕\n1. 传说中的野兽\n    - 奖励2技能点\n    - 任务初始NPC 塞巴~沙漠商人 （瓦德杰溪谷）\n\n### 第三幕\n1. 皇帝的兵马俑\n    - 奖励2属性点\n    - 初始任务 NPC 魏徽~传讯官 (长安城)\n    - 完成任务 NPC 宫殿里的某皇帝 \n\n### 第四幕\n1. 蓝比度的药剂\n    - 奖励力量和生命值\n    - 任务完成/初始NPC 蓝比度侍僧（罗德岛后面那个传送点）\n2. 冥河的潜伏者\n    - 奖励 属性\n    - 任务初始 NPC （科普柔斯~幽灵猎人）\n3. 泰坦之尘\n    - 奖励 2技能点\n    - 任务初始 NPC 勒达~幽灵女祭司 （漂流街上层）\n4. 哈迪斯将军\n    - 奖励 5%全伤害\n    - 初始任务 NPC 冥殿外在主线任务NPC的上方（炸开门的那个NPC） \n\n![image](https://s.doyo.cn/img/4f/c0/a9019e9e782a63004523.jpg)\n\n### 第五幕\n1. 被困的水妖\n    - 奖励 1技能点\n    - 初始任务 NPC\n    - 任务初始/完成 NPC 莉莉~绝望的水妖  (格劳堡 - 野石南原)\n2. 侏儒王国历史\n    - 奖励 2技能点\n    - 任务初始/完成 NPC 瓦尔迪丝-女萨满（黑暗大地 - 卡帕格）"
      },
      {
        "title": "人物属性的详解",
        "md": "# 人物第一属性\n\n## Strength：力量\n\n增加物理攻击力，前提是你用的武器是弓，剑，锤，斧，矛。间接性提高穿刺攻击力，前提是你用的武器含有穿刺成分。用法杖，你加力量不会提高你的攻击力，因为法杖是元素攻击。\n\n## Intelligence：智力\n\n增加元素攻击力，前提是你用的武器是法杖，或者你身上装备为你提供了一个元素伤害基础值，比如有些武器会有X~Y的火属性伤害，智力会对这基础值加成。其实大家也可以把法杖理解为：法杖给你提供了一个元素伤害的基础值。\n\n## Dexiterity：敏捷\n\n直接增加穿刺攻击力，前提是你用的武器是弓，剑，矛，因为只有这三种武器有穿刺伤害成分。另外有些装备会提供穿刺伤害基础值，敏捷对这种基础值也有攻击加成。\n\n另外，敏捷还增加战斗能力，防御能力，具体这两属性是怎么回事，后面会解释。\n\n## Resistence：抗性\n\n各种抗性对应各种伤害类型。\n\n火，冰，电属于元素抗性，有些装备提供 “N%元素抗性” 就是直接加到这三个抗性上去。这里说明一下，由于火属性伤害有一种叫做“燃烧伤害”，是一种持续性的伤害（台风，机器人王的喷火就是燃烧伤害），而火抗性只能降低“燃烧伤害”每秒造成的伤害，但并不能降低燃烧持续的时间，这也是为什么很多人觉得80%火抗对台风的喷火好象没什么用，一来是因为台风的火燃烧基础伤害值高，二来是台风的火有持续时间。\n\n毒抗性只是降低毒所造成的伤害，并不会降低毒持续时间。\n\n穿刺抗性，降低穿刺攻击所造成的伤害。\n\n这里5个抗性最高只能达到80%，在史诗和传奇难度，这5个抗性会有惩罚，就是说抗性会变成负的。\n\n## Average Damage：平均伤害\n\n经过系统计算后所得出来的“你普通攻击的攻击力值”，注意，是普通攻击，这里的计算已经把技能对伤害的加成也计算在内。这里的计算包括所有你装备提供的伤害类型 （元素，物理，穿刺，毒等等）\n\n## Attack Speed：攻击速度\n\n如其名，就是你人物攻击的频率，最高190%。注意：双持最高是171%\n\n## Damage Per Second：每秒伤害\n\n就是大家常说的DPS，这是系统在平均伤害基础上，再根据你攻击速度而得出来的值，最能反应你人物的攻击力，但注意的是，这个DPS只代表你正常攻击力，并不包括机率性攻击，因为机率性攻击是由系统随机出现，不可能也把其计算在DPS里面。\n\n## Combined Armor：综合防御值\n\n其实中文翻译有点不对，应该叫综合护甲值才对。这个就是你人物各部位装备的护甲总值。护甲可以理解为“物理攻击力的抗性”， 因为护甲只对物理攻击力有效，对其他类型的攻击力不会起作用，但由于游戏里面主要都是以物理攻击力为主，所以护甲值还是挺重要的，特别是近战职业。\n\n另外这里提一下，有些装备会提供一些属性对护甲加成的，其中“N% Armor Protection 护甲保护” 最为常见，这属性不会直接反映在护甲总和上面，但会提高护甲的保护程度，简单来说就是在现有的护甲指数基础上降低物理攻击力所造成的伤害，另外还有防御专精技能“盔甲掌握”所提供的护甲吸收也是一样道理。还有一种属性叫做“N% Damage Resistence 伤害抗性”，这属性跟上面所提到的抗性其实是一样道理，直接用降低N%百分比的物理伤害。\n\n## Block：格挡\n\n这个我想很多人都知道怎么回事，就是盾牌会出现格挡的机率。\n\n## Damage Blocked：盾牌格挡掉的伤害\n\n如其名，在出现盾牌格挡时能格挡掉的伤害，这里的伤害只包括元素，物理，穿刺，不包括毒之类的状态持续性伤害。\n\n---\n\n# 人物第二属性\n\n## Secondary Resistences：其他抗性\n\n流血抗性：减少流血攻击的持续时间以及伤害\n\n活力抗性：减少一切活力攻击（包括血量百份比伤害，生命吸取，活力伤害）伤害以及持续时间\n\n能量抗性：减少一切能量攻击（包括能量燃烧，能量吸取）所造成的能量损失以及持续时间\n\n眩晕抗性：降低眩晕时间以及眩晕伤害\n\n技能打断抗性：降低技能打断时间\n\n其中活力抗性和能量抗性比较特别，由于活力抗性和能量抗性是一个总抗性（意思就是一个抗性包括了多种类型伤害），所以有些装备带有的抗性不会在这两个抗性体现出来，因为这些装备带有的抗性只是他们包括的伤害中的一个类型而已。举个例子，比如动物符石“恶魔的血”提供了“活力伤害抗性”，但用上后你会发现并没有在“活力抗性”上体现出来，就是因为“活力伤害抗性”只是“活力抗性的一部分而已。\n\n另外要注意的是，这里的抗性并没有上限，所以不要以为这里抗性有100%就足够了，特别是眩晕抗性，对于近战职业是越高越好，因为即使你200%眩晕抗性，被一些眩晕比较久的技能打到依然会眩晕0.5秒~1秒左右，比如牛头的冲撞，机器人王的火和脚踏，半人马队长的号角等等。\n\n注意：这5个抗性在1.20以前的版本，在史诗和传奇难度都有惩罚，1.20则取消了这5个属性的惩罚。\n\n## Health Regeneration：生命恢复速度 和 Energy Regeneration：法力恢复速度\n\n如其名，其数值就是每秒恢复的生命和能量值\n\n## Offensive Ability：战斗能力\n\n关乎你人物攻击时的 “命中率” 和 “爆击率” ， 具体机率由 你的战斗能力 和 敌人的防御能力 决定。这数值对于用弓，法杖的人来说，可以忽略，因为弓和法杖是必中的，除非敌人有躲避飞行物的属性，而且弓和法杖是不会出现“爆击”的。经过实践，在传奇难度里面要频繁出现“爆击”，就需要1300以上的战斗能力，当然了，越高越好，而要达到这数值，必须要修战斗专精里面的“武器训练”才可能达到。“爆击”是修了战斗专精的近战职业的重头戏，提高战斗能力是这些职业所必须要做的。\n\n注：爆击的伤害部分只是”物理伤害“，其他伤害是不会爆击的。我经常会见到“穿刺爆击”，这里告诉大家绝对没有什么“穿刺爆击”或者“元素爆击”（火属性伤害可以“爆击”，但前提是要学了大地专精的“爆发”）\n\n## Defensive Ability：防御能力\n\n跟战斗能力相反的属性， 就是关乎你人物“躲避率” 和 ”不被爆击率” 的属性，具体机率由 敌人的战斗能力 和 你的防御能力 决定。 注意，这里躲避的只有近身攻击，不包括远程。经过实践，防御能力达到1200左右就能频繁躲避和不会被爆击，而要达到这数值必须要修狩猎专精的“木材知识”才可能达到。\n\n## Cast Speed：施展速度\n\n这是一个关于你在使用技能法术时一个硬直时间，比如你召唤时会有一个召唤的动作，需要1秒左右的时间，如果把施展速度提高，那么你就可以降低这个时间以达到瞬间招出宝宝。\n\n## Run Speed：移动速度\n\n在地图上的移动速度\n\n移动速度对脆皮而又没有位移技能的bd，如纯弓巡林客、心光占卜师等较为重要，更高的移动速度往往意味着能拉扯出更大的作战空间，保证安全的前提下变相提升输出"
      },
      {
        "title": "各种属性的上限",
        "md": "- 移动速度：`166`\n- 施展速度：`300`\n- 攻击速度：\n    - 近战双持：`199`\n    - 近战单持：`222`\n    - 投掷双持：`141`\n    - 投掷单持：`208`\n    - 法杖：`240`\n    - 空手：`300`\n- 各种抗性：`80`（仅对玩家人物角色生效）\n- 近闪：`80`（仅对玩家人物角色生效）\n- 远闪：`80`（仅对玩家人物角色生效）\n- 减CD：`80`（仅对玩家人物角色生效）\n\n> 攻击速度机制，推荐参考：贴吧-[游戏机制研究之：攻速那些事](https://tieba.baidu.com/p/6611540082#/)，作者：gx16377"
      },
      {
        "title": "伤害类型与种族克制关系",
        "md": "![image](https://www.hualigs.cn/image/60d4728013394.jpg)"
      },
      {
        "title": "攻击能力（OA）与防御能力（DA）",
        "md": "攻击能力和防御能力是游戏中人物和怪物的两个基本属性\n\n- 攻击能力：英文 Offensive Ability，简称`OA`\n- 防御能力：英文 Defensive ability，简称`DA`\n\n发动近战攻击时，攻击方的OA和被攻击方的DA决定了攻击的命中率，攻击伤害的修正(暴击或者伤害惩罚)，同时影响被攻击方的格挡几率。\n\n> 详细机制推荐参考：贴吧-[攻击能力和防御能力的研究](https://tieba.baidu.com/p/6896993887#/)，作者：風不渡\n\n> 以下引用部分结论，供游戏时参考\n\n`传奇难度第4幕人物DA应该保证加到850以上，第5幕DA应该加到1000以上，上不封顶，越高越好。在2750的DA以内，每一点DA的性价比都是越来越高的。`\n`至于人物OA，第4幕830第5幕980，可以保证百分百命中。要想获得较好的暴击率，应分别加到1330和1480以上，此时人物有1/3的最大暴击概率。 OA的性价比是越加越低的，但是为了暴击率还是得加，个人认为在1600以内OA都是值得加高的`"
      },
      {
        "title": "降抗机制的详细解析",
        "md": "首先说明本文涉及的内容：\n\n1. 降低全部抗性、百分比降低全部抗性，以及削弱敌方型技能中的降低抗性，统称“降抗”，放在一起分析。\n2. 减慢攻击、减慢移动、减慢全部速度，以及削弱敌方型技能中的降低速度，统称“减速”，放在一起分析。\n\n这是除了常见的物理、穿刺、元素、活力等伤害外，一些我们一直使用但是常常弄不明白的东西。伤害详解（即伤害教科书）中虽然有详细解释，但是此文由于过于严谨，对于某一特定伤害反而难以理解，故仅在此用通俗易懂的语言（真的通俗易懂吗？我怎么觉得好多废话……）重新解释这几种伤害类型，方便各位选择装备或者设计打法。其余伤害类型（包括降低护甲，降低战斗能力等）均不在本文讨论范围内。\n\n这里首先要讨论什么东西能发动这些伤害？一直有人问比如双持能否发动XX上面的伤害？冰晶能否吸血？等等问题。先对此进行解释。主动攻击分为武器攻击和技能攻击，被动攻击分为反击和反弹。为了方便（其实是我懒），本文不讨论所有被动攻击造成的伤害，下面列出的技能中有关反击伤害的部分也将被无视。本文不会列出宠物的技能，想必各位如果看懂了人物的技能，宠物也是一样的。本文亦不讨论以下过程：躲避、暴击、盾牌格挡、护甲值。因为讨论那么多太麻烦了……但是实际上的确包含以上过程。\n\n首先说武器攻击。武器攻击包括普通攻击（也就是平砍啦），以及武器攻击型技能。包括以下所有：\n\n`表1`\n\n- 盗贼专精：预谋打击、致死打击\n- 防御专精：盾牌冲击、盾击、英勇打击、压制、粉碎（注意盾牌也是一种武器，但是是一种可以格挡的武器）\n- 梦幻专精：心灵接触、幻影攻击\n- 狩猎专精：射术、猛刺、齐射\n- 死灵专精：三重打击\n- 战斗专精：双手持刃、劈斩、十字斩、乱舞、冲击、战风\n\n各种装备上赋予的技能不列举，太累了= =以后也不会列举。\n\n另外，一些强化己方型技能也会赋予武器攻击一定的基础伤害，包括以下所有：\n\n`表2`\n\n- 大地专精：大地附魔\n- 盗贼专精：毒素武器、割裂（有了致死打击的先例后，这个技能我也有点怀疑。泰坦立方中写着有效武器：斧、矛、剑、弓，但不知是否真的如此？）\n- 风暴专精：风暴之手\n- 狩猎专精：凿击（同盗贼专精的割裂，我有点怀疑）\n- 死灵专精：灵魂守护（其进阶灵魂诅咒附带特定种族伤害，也算基础伤害的一种）\n- 战斗专精：战斗狂暴（其进阶致命一击也是）、战斗军旗（这个技能其实根本不直接增加伤害，而是赋予很高的物理伤害，不过很可惜不能被力量加成……）\n\n\n在使用列表1里面的技能时，除了武器本身的基础伤害（比如XXX-XXX物理伤害，XXX-XXX火焰伤害等）以及武器攻击型技能本身附带的伤害外，除武器外所有装备（包括神器），以及列表2里技能所赋予的基础伤害都会发动。包括XX点XX伤害，XX点XX伤害持续XX秒，降低抗性，减缓速度，百分比伤害转化生命等等。但是，在本次攻击中没有被使用的那把武器（或者盾牌）上面的基础伤害（包括符文或遗物）都不会发动。伤害加成则不遵循此规则，无论哪里的伤害加成始终有效。举例说明下。比如双手持刃，两把武器属性分别如下：\n\n`武器一属性`\n- 135 ~ 144 伤害\n- 15% 穿刺\n- 速度：0.50（基础攻速：106%）\n- +36 敏捷\n- +30% 攻击速度\n- +35 点战斗能力\n- 镶嵌遗物：神农的黑色药[大]\n- 288 毒素伤害在6.0秒内\n- 18 降低抗性 持续 6.0 秒\n- 合成奖励：7 ~ 16 伤害\n\n`武器二属性`\n- 134 ~ 139 伤害\n- 10% 穿刺\n- 速度：0.45（基础攻速：102%）\n- 8% 攻击伤害转换为自身生命值增加\n- +480 生命\n- +7% 力量\n- +7% 敏捷\n- +15% 攻击速度\n- 每秒+2.0点生命恢复\n- +50% 生命恢复速度\n\n假设此时武器一发动武器攻击，那么两把武器上哪些属性有效呢？武器一上面肯定所有属性都有效，包括神农所给与的降抗（具体效果后面解释）和附加的毒素伤害、物理伤害。而在武器一攻击时，武器二上的8%攻击伤害转换为自身生命值增加并不能发动！只有+7%力量和+7%敏捷对武器一有加成（关于双持的攻击速度问题我暂时还没弄明白，不讨论）。如果武器二是盾牌，同样如此。同样的，在武器二发动攻击时，武器一上的降低抗性和毒素伤害是不会发动的，只有+36敏捷和+35战斗能力有效。假如此时你同时开启了技能“风暴之手”，那么无论哪把武器攻击时，风暴之手的冰冷/闪电伤害都会有效。\n\n·这里有个特例，盗贼专精的投掷技能，即飞刀。这个技能属于类武器攻击，也就是说飞刀代替了武器（包括盾牌）发动武器攻击。因此和武器攻击一样，除武器外所有部位装备（包括神器），以及列表2里技能所赋予的基础伤害都会发动。但是由于飞刀不属于两把武器之一，所以两把武器上（包括盾牌）的基础伤害都不会发动。包括X%攻击伤害转换为自身生命值增加、减抗、XX点XX伤害等等。\n\n·接下来是技能攻击。这里仅指直接攻击型的技能，包括以下所有：\n\n`表3`\n- 大地专精：火焰之环、火焰奔腾、火山岩球、火山爆发\n- 盗贼专精：毒气弹、致盲\n- 风暴专精：咒语打断、闪电术、冰晶、闪电球、暴风、风暴汹涌（注意这不是反击伤害，只是发动条件是被动而已）、冰封术\n- 梦幻专精：感同身受、神罚、沉睡之沙、扭曲现实、扭曲波浪\n- 狩猎专精：诱捕、引诱\n- 死灵专精：生命吸取、奴役、灵魂之环、死亡凝视\n- 战斗专精：战争号角\n- 自然专精：瘟疫\n\n在使用这些技能时，只有本技能（包括进阶）的基础伤害会生效，所有装备或其他技能的基础伤害均不发动。也就是说，这些技能的伤害是排他的。因此，指望放冰晶能吸血等，是不可能实现的。这里有一个特例：非武器上面的特定种族伤害仍然有效。比如死灵专精的灵魂诅咒，赋予一定亡灵种族伤害，在使用任何以上技能时始终会发动。但是有些技能会会被发动（假若对方确实属于特定种族的话）。但武器上附带的特定种族伤害却不会被发动。不过，有些直接攻击技能为了避免这种伤害被发动，有一个专门的属性设定，即“攻击时不附加种族伤害”，例如神罚。\n\n能造成敌方抗性降低的其实分为两种，一种叫做“削弱敌方型技能”，另一种是“主动性属性伤害”（反击型属性伤害中不存在降低抗性反击）。不过伤害教科书里面不把削弱敌方型技能叫做“伤害”，真是麻烦……还是先列表吧。\n\n削弱敌方型技能包括如下这些：\n\n`表4`\n- 狩猎专精：狩猎大师\n- 死灵专精：死亡寒意（其实是骨疽）\n- 战斗专精：战旗（其实是胜利之光。注意如果不打BUG修复补丁此进阶无效）\n- 自然专精：瘟疫（其实是感受性）\n\n而能造成“主动型属性伤害”的技能（仅就降低抗性而言）包括如下这些：\n\n`表5`\n- 风暴专精：暴风（其实是阴暗视线）\n- 梦幻专精：神罚\n- 死灵专精：巫妖自己学会的技能：精神摧残\n\n除此以外，有相当多装备能造成抗性降低，同样属于“主动型属性伤害”。包括如下这些：\n\n`表6`\n- 特绿（三个难度下）\n    + 巫医手镯、刺木弓\n- 唯一类装备\n    + 臂（法）：虚弱臂环、内行人护臂、食客的卷曲束腕、大法师护臂（术士护臂这个翻译显然不怎么精确）\n    + 锤：枯萎病、得墨忒尔的悲伤、吕卡翁的锤、冰河之锤、堕落者\n    + 盾：仪式舞者之盾、赫拉盾牌\n    + 斧：科赛特斯河的战斧、火花之剪\n    + 弓：锡巴里斯\n    + 剑：绝望\n    + 矛：亵渎者、福耳库斯的三叉戟、撼地者\n    + 项链：金银合金护身符、北极星\n    + 杖：螺旋、湿婆的伴侣、织梦人的竹竿、北风神的骨手\n- 套装奖励\n    + 鲁泽的礼物、头骨全铠、先驱者、织梦人的徽饰\n- 遗物（三个难度下）\n    + 猴王的戏法、神农的黑色药\n\n还是根据伤害教科书来，将所有抗性分为三种：普通抗性、状态抗性、特殊抗性\n\n普通抗性包括：物理、穿刺、冰冷、火焰、闪电、毒素、活力、流血、生命吸取、法力吸取、技能打断、缓慢\n\n此类抗性的计算方式如下：\n1. 令：A = 抗性 + |抗性| * 抗性加成%\n2. 当前抗性 = A - |A| * 百分比降低全部抗性% - 降低全部抗性\n3. 若：当前抗性 > 抗性上限，则：当前抗性 = 抗性上限\n\n话说我始终没有找到“抗性加成”出现在哪里，何况这个和本文讨论的内容无关，所以无视了。\n\n对于列表4中的所有技能，其效果作用于\n1\\.    令：A = 抗性 + |抗性| * 抗性加成%\n\n比如传奇难度提丰，自身有45%穿刺抗性，同时传奇难度单人游戏难度强化赋予了30%穿刺抗性，总计75%穿刺抗性。受到狩猎大师（满级+4，以后全都以此作为标准）的影响，-66%穿刺抗性。此时提丰的基础穿刺抗性为：75-66=9。这个数字将代入下一步计算！也就是说，削弱敌方型技能是作用于敌方基础抗性的，且计算时先于列表5和列表6。即削弱敌方型技能类似于给怪物穿上一件装备，只不过装备的效果是负面的。既然是削弱敌方技能等于一件装备，那么不同装备显然可以直接叠加，因此瘟疫、狩猎大师、胜利之光（打了BUG修复补丁以后）的降低物理抗性的效果可以直接叠加。注意一点：所有正常游戏中的削弱敌方型技能都是直接按照点数降抗，而非百分比降抗（这里不是指“降低全部抗性”和“百分比降低全部抗性”这两种伤害形式）。因此，在泰坦立方中，狩猎大师的“-66%穿刺抗性”实际上应该是“-66穿刺抗性”，或者更准确的说，“-66基础穿刺抗性”。\n\n之后轮到列表5和列表6中的技能和装备生效。实际上这两者没有本质区别。\n2\\.    当前抗性 = A - |A| * 百分比降低全部抗性% - 降低全部抗性\n可以看到这里有两种类型的伤害：“百分比降低全部抗性”和“降低全部抗性”。后者俗称点数降抗。至于列表5和列表6中的技能和装备分别属于哪种，自己打个2.7汉化补丁查看（不是2.7汉化补丁界面显示可能有错！），我就不一一列举了。对于以上两者中的任一种伤害（就是说两者分开算的），在持续时间内又发生第二次同类伤害，将选择数值之和较高的那次攻击造成的伤害进行实施（这也是所有延迟实施的叠加法则）。这话很绕吧……我举例说明，看懂例子你也就明白了。\n\n沿用前面提丰的例子，代入基础穿刺抗性9。此时提丰又受到暴风的影响：45% 降低抗性，持续6.0秒。然后你立刻（不考虑时间）进行了一次普通攻击，此时你装备的赫拉盾牌发挥作用，20%降低抗性，持续 3.0 秒；巫医手镯（传奇）也发挥作用，30%降低抗性，持续 3.0 秒。那么现在提丰的穿刺抗性是多少？根据原理，你发动普通攻击时，因为是在一次攻击中发动的同类伤害，因此主伤害数值直接叠加，即20%+30%=50%降低抗性！而副伤害数值同为3秒。那么在3秒内，50>45，同类伤害取最大值，你普通攻击造成的降低抗性效果覆盖暴风的降低抗性效果。因此，此时提丰的穿刺抗性为：9-9*50%=4.5。而在3-6秒内，你普通攻击造成的降低抗性效果已经消失，而暴风的效果仍然存在，则提丰的穿刺抗性为：9-9*45%=4.95。这样，为什么暴风和神罚效果不能叠加想必大家能理解了吧？\n\n同样的，再来看另外一种。可怜的提丰（这里取3秒内的那个值，即穿刺抗性为4.5）又被你双持发动锤了一下，你右手拿着得墨忒尔的悲伤，左手拿着堕落者（迅速换装啊……）。我们知道，当双持发动时，并不是真的一次攻击使用两把武器，而是先用右手武器攻击一次，再用左手武器攻击一次（注意右手对应人物界面左边，左手对应右边）。因此，当右手的得墨忒尔的悲伤（15降低抗性，持续 2.0秒）攻击后，提丰的穿刺抗性变成了4.5-15=-10.5。而当左手的堕落者（60降低抗性，持续3.0秒）攻击时，北极星（40降低抗性，持续3.0秒）也发动，则在右手攻击时总计“降低全部抗性伤害”的主伤害值之和为60+40=100。100>15，同类伤害取最大值，所以立刻覆盖原有效果，提丰的穿刺抗性变成4.5-100=-95.5。\n\n不知道经过以上繁琐的讲解以后，对于降低抗性如何计算能否完全理解了呢？要是还不能理解……那去看伤害教科书吧，比我更详细……\n\n3\\.         若：当前抗性 > 抗性上限，则：当前抗性 = 抗性上限\n\n这个我不多说了，玩家的所有抗性上限均为80，怪物和你的宠物没有此限制。\n\n·，接下来是状态抗性，包括：晕眩，冰封，石化，昏睡，陷阱、意识控制、恐惧、混乱、嘲弄（后四种对玩家无效，仅对怪物和宠物有效）\n\n这类抗性不受“百分比降低全部抗性”和“降低全部抗性”这两种属性伤害的影响。但“削弱敌方”型技能一样可以降低这类抗性，并且也可以降到负值。\n\n当前抗性 = 抗性 + |抗性| * 抗性加成%\n\n若：当前抗性 > 抗性上限，则：当前抗性 = 抗性上限\n\n公式中“抗性加成”和“抗性上限”的含义同上。\n\n貌似正常游戏中能削弱敌方状态抗性的貌似只有胜利之光的-50%眩晕抵抗这一项（还有别的欢迎举例）。还是举个例子。传奇难度哈迪斯（形态一）拥有100%晕眩抵抗，难度强化给与30%晕眩抵抗，总计130。但在胜利之光作用下，即哈迪斯的晕眩抗性变成了130-50=80。也就是说，此时你能够把它敲晕了！\n\n·第三类抗性其实只包括两种：燃烧法力（造成伤害）抗性、百分比损血抗性。这类抗性仅被BOSS所拥有，小怪和玩家都是无法拥有的。这类抗性的当前抗性计算公式为：\n\n当前抗性 = 抗性 - |抗性| * 百分比降低全部抗性% - 降低全部抗性\n\n若：当前抗性 > 抗性上限，则：当前抗性 = 抗性上限\n\n这个公式的计算方法和普通抗性完全一样，只是没有第一个步骤而已。\n\n上述公式有一个特例：假若“抗性”一项没有任何来源，则当前抗性 = 0，也就是说降抗伤害无效。不过，只要有一个来源（不论是在装备上还是在技能里），哪怕只有0.01，则按上述公式计算当前抗性。原始游戏中，BOSS都有该类抗性，而普通小怪没有，于是，只要有足够的降抗能力，就足以把BOSS的该类抗性降到负值，但对普通小怪却是无法降抗的。不过无法降低抗性不代表伤害无效，小怪的这两项抗性始终为0，因而其实也不需要降抗……\n\n另外，这两项抗性都不是单独作用的。具体如下。\n\n·百分比损血伤害：\n伤害修正阶段：主伤害数值 = 原主伤害数值 * (1 - 活力抗性%) * (1 - 百分比损血抗性%) * (1 - 百分比种族伤害降低%)\n\n好，那我们就来看看死灵专精是怎么秒杀BOSS的。\n\n还是那传奇提丰作为目标（可怜的孩子啊……）。基础百分比损血抗性为96，活力抗性为60。\n\n骨疽：-119活力抗性\n\n此时提丰的活力抗性为：60-119=-59\n\n巫妖自己学会的技能精神摧残：75% 降低抗性 持续 8.0 秒；33%减少敌人生命值\n\n和堕落者一样，第一次攻击的时候抗性并不降低，所以百分比损血抗性还是96\n\n则(1 - 活力抗性%) * (1 - 百分比损血抗性%)=0.0636\n\n33%*0.0636=2.0988%，也即第一次攻击造成提丰2%的血量损失，实在可以无视……\n\n在此次攻击后，精神摧残的降低抗性发挥作用，则\n\n活力抗性：-59-59*0.75=-103.25\n\n百分比损血抗性：96-96*75%=24\n\n则(1 - 活力抗性%) * (1 - 百分比损血抗性%)=1.5447\n\n也就是说，经过精神摧残后，你的百分比伤害对提丰的效果提升为原先的1.5447倍……\n\n33%*1.5447=50.9751%，也就是说你一次造成BOSS一半血量的伤害……\n\n注意在百分比伤害中，被攻击方的生命值扣减数值 = 被攻击方的当前生命值*主伤害数值%，就是说这个50%是当前血量的50%，不是最大血量的50%，切记。\n\n假设你不小心手上还拿着把堕落者，锤了提丰一下……（均在持续时间内）\n\n则可怜的提丰的抗性现在变成了：\n\n活力抗性：-103.25-60=-163.25\n\n百分比损血抗性：24-60=-36\n\n则(1 - 活力抗性%) * (1 - 百分比损血抗性%)=3.5802\n\n33%*3.5802=118.1466%！！！！\n\n秒杀！\n\n通过此过程可以看出，其实活力抗性对于百分比扣血秒杀BOSS的作用比百分比伤害抗性更重要，也就是说，骨疽要优先加满。\n\n·然后是燃烧法力造成伤害抗性。实际上燃烧法力造成伤害分为两部分：先是按照一定百分比造成法力值的降低，即XX%燃烧法力（注意是最大法力值，而非现有法力值），这部分受到敌方法力吸取抗性的影响。第二部分由第一部分造成的实际法力值减少决定（注意是实际），根据这个减少的数字再按照一定百分比造成生命值的减少，这部分受到敌方燃烧法力造成伤害抗性的影响。说那么多其实就是个魔兽里面的MANA BURN……\n\n还是看个例子，以传奇曼提克为例，看看风暴专精能否秒杀它。\n\n先列出属性。\n\nHP：（15873+500）*（1+50%+415%）=92507.45\n\nMP：18802*（1+200%）=56406\n\n法力吸取抗性：85+30=115\n\n燃烧法力造成伤害抗性：70\n\n开始先扔个暴风（45%降低抗性）。则\n\n法力吸取抗性：115-115*45%=63.25\n\n燃烧法力造成伤害抗性：70-70*45%=38.5\n\n然后使用技能：咒语打断（100%燃烧法力，+50%伤害对召唤物，+150伤害对召唤物，    195%燃烧法力并造成伤害）\n\n先计算第一步，由于曼提克属于召唤物（囧，我还以为它是野兽呢……），因此受到+50%伤害对召唤物的影响。\n100*（1+50%）=150\n\n然后进入伤害修正\n\n150*（1-63.25%）=55.125\n\n则实际造成的法力损失为56406*55.125%=31093.808\n\n注意第二步燃烧法力造成伤害的时候不必再次计算特定种族加成了！\n\n伤害修正阶段\n\n195*（1-38.5）=119.925\n\n则实际造成的生命值损失为31093.808*119.925%=37289.249，离秒杀貌似有点距离啊……\n\n不算BOSS的回魔，再次使用咒语打断\n\n此时剩余法力值为25312.192<31093.803，因此此次攻击只能把它的法力值降到0，不能再降低了，而这个值也将代入下一步计算。\n\n25312.192*119.925%=30355.646\n\n这两次咒语打断后，曼提克剩余HP为：24862.555，此时它已经没有魔法了，剩下的HP要靠自己打= =。\n\n好，来看看如果有了北风神的骨手会如何。再放暴风后，使用北风神的骨手（35降低抗性）进行一次普通攻击。此时曼提克\n\n法力吸取抗性：63.25-35=28.25\n\n燃烧法力造成伤害抗性：38.5-35=3.5\n\n然后还是使用咒语打断，仿照上面流程\n\n150*（1-28.25%）=107.625\n\n则实际造成的法力损失为56406*107.625%=60718.541\n\n195*（1-3.5%）=188.175\n\n则实际造成的生命值损失为60718.541*188.175%=114257.11>92507.45，秒杀！\n\n从以上我们也能看出，充分降抗对于燃烧法力造成伤害十分重要啊……\n\n·好，关于抗性就到这里为止了。最后简单提一下关于减速的问题。\n\n这里本来写了很多，发觉太麻烦了，全删了，我只想说几点：\n1. 实际上，减速也和降抗一样，要分为两种：削弱敌方型技能造成的减速，和减速这类伤害。\n2. 削弱敌方型技能造成的减速包括：死亡寒意的减速，瘟疫的进阶疲劳的减速。这两个技能直接作用于基础速度，可以叠加，无视缓慢抗性。\n3. 减速伤害对应的抗性是缓慢抗性，这是一种普通抗性，可以被降低全部抗性和百分比减低全部抗性影响。BOSS的此项抗性普遍高于100。也就是说，完全可以通过降抗后再减速让BOSS变得慢吞吞。具体看降抗部分的解释。\n4. 减速伤害分为减慢攻击、减慢移动、减慢全部速度这三种。每一种伤害在持续时间内的叠加都按照延迟实施的叠加法则计算。具体还是看降抗部分的解释。\n5. 每种速度均有下限！因此，指望减抗后的BOSS的速度变得和乌龟一样慢是不可能的。\n6. 实际速度的计算方法很复杂，这里不解释。\n\n完。话说全文要是都像最后一段一样多清爽啊……\n"
      }
    ],
    "攻略心得": [
      {
        "title": "游戏前中期通关过渡推荐装备",
        "md": "### 法头\n艾帕佛斯的镀金帽，红盔（火法），阿鲁比阿努斯头盔，珍珠帽（元素转换）\n\n### 战头\n硬壳头骨帽（适合斗士），掠夺者头盔\n\n### 锤\n反对封印\n\n### 剑\n贝瑞托斯之钥，巴斯博纳的匕首\n\n### 矛\n秦子婴的刀，拉提\n\n### 斧\n猫头鹰\n\n### 投掷\n火焰国的火花，卡戎的手指，小火把，骷髅飞镖\n\n### 盾\n羊毛挂盾，凶兆，勾泰之盾，月之盾，幼发拉底奔流之盾，精英护卫，朝霞\n\n### 杖\n东方三博士杖（特绿），占卜之眼，鲁谷斯之杖\n\n### 戒指\n漩涡纹戒，商朝戒指，高级牧师印戒\n\n### 项链\n陨落之珠，诡诈珠链，琥珀项链，矮人骨质神物，迈密登垂饰，斯卡迪的垂饰，神之愤怒垂饰\n\n### 衣服\n保镖铠甲，工匠的学徒长袍，凯尔特熔炉铠甲，术士之服，阿瑞库拉马甲，分层式胸甲，维瑞多玛鲁斯的半身甲，奥德修斯铠\n\n### 护臂\n阿特拉斯全手甲（反弹用），高迪的束腕，大地之母的扣带，布卢姆的臂环，圣手环\n\n### 腿\n阿克拉伽斯的闪亮护胫甲, 蓝海葵, 塞德曼的绑腿, 布里拖马里斯的挑衅,希罗纳的护腿, 狄威提亚卡斯的防护网, 女萨满的硬化绑腿，雅典娜战斗胫甲, 蛮族锥形胫甲\n\n### 神器\n奥内罗斯的卷轴，混沌立方，叶子的歌唱，蠢人之触，剃刀般的爪（宠物），灵魂颤抖，梦想之书，赛德骷髅，天火的雕像，玉制的神像，阿瑞斯的鲜血，征服者的标记，元素的愤怒，博学者的记号，拉之眼\n\n> 殛夢整理，koko指正"
      },
      {
        "title": "游戏后期实用装备",
        "md": "### 法头\n许普诺斯的头冠，赫西俄涅的金面纱，斯忒诺的智慧(特绿)，阿喀罗伊的面具，铎柯摩.昂的王冠，提瑞西阿斯的向导，普鲁顿的王冠，阿格里斯金头盔（元素转换）\n\n### 战头\n艾波娜的短马鬃（宠物），科尔之脸, 追踪者兜帽，士兵护盔（特绿），亡灵领主的面甲，水晶头盔（反弹），征服者头盔（减等级需求），刺客面罩(毒)，阿伽门农死亡面具，乌尔德帽，布林希尔德头盔，金牙战士护头甲（特绿）\n\n### 锤\n碎骨器（战），无情伙伴（法），堕落者，吕卡翁的锤，巨人之牙，影子国王的王杖，纳格尔法船首像\n\n![image](http://img4.gamersky.com/Files/GamerSky/handbook_UploadFiles_4058/200804/2008042819110860.jpg)\n\n### 剑\n\n格兰，拉瓦泰因，黎明之匕首，英灵战士的命运（特绿），霍夫德（元素转换）\n\n### 弓\n\n尼德弓(活力)，鼓瑟尔的礼物（物理穿刺），伊希斯之翼（元素），伊查瓦尔弓\n\n### 矛\n野外狩猎，黑刚枪（特绿），墨鱼骨旗帜，永恒之枪冈尼尔\n\n### 斧\n旧刻痕（技能流），昂格雷，猫头鹰，斯塔卡德之妻，略瑟提厄斯的热情（宠物），阿特洛波斯的助手，珀尔塞福涅的爱抚，金牙战士战斧（特绿），圣境之匙，仪式砍刀\n\n### 投掷\n雷神之锤，莫伊娜的祝福，戈尔贡之岸，夜神之触碰，提雅玛之鳃，太阳精气，黄金波形刀，水仙之风，弗雷伊拉（史诗球出）\n\n### 盾\n帝摩斯的恐惧，普里阿摩斯之门，雅典娜镜之盾，鱼人盾（特绿），维萨姆的野猪，奇异的壳（特绿），贝拉隆的金盾，鲨鱼鳍，毒液盾牌，哈迪斯之盾\n\n### 杖\n勘探者之魔棍（特绿），普纳斯帝克，宇宙之杖，克兰托尔的轨迹，北风神的骨手，盟约之杖\n\n### 戒指\n三人之戒，反射，娴熟指环，透特的印戒，辛德里的指环，天神之戒，阿波罗意志指环 ，慕容婚戒，阿拉克尔指环\n\n### 项链\n阿芙罗狄蒂的宠爱，祖先的项圈\n\n### 衣服\n萨均全铠，弗莱娅胸甲，波斯祭司的法衣，冰鳞，贝比兹姬全甲\n\n### 护臂\n凿石工护腕，内米亚狮子手甲（宠物），大法师护臂，弗莱娅臂环，格里姆希尔德大蛇（-cd）,通灵之主的护臂，超深渊带手甲，凯尔特猎犬\n\n### 腿\n玛尼之盾（宠物），赫华勒的合金钢，弗莱娅长靴，巨魔摔跤手护胫甲，普鲁顿的护腿，蒙戈之短裤，伊苏斯的军旅靴，魔皮束腿, 金牙战士护腿,贝里萨马护胫甲\n\n### 神器\n透特的荣誉，伊师塔的星辰，马杜克命运的写字板，玉皇大帝的护身符，甘班天恩，摩尔甫斯的梦网（其他天赐神器后面再合）\n\n#### 套装\n鲁泽的礼物，提亚尔菲的嵌钉皮裤，布伦努斯之傲，爬虫肢甲，苏克鲁斯臂环，阿尔戈\n\n---\n\n#### 龟洞\n焦油之影，焦油踢靴，雪球（*）\n\n#### 经验套\n阿斯隆，莱茵河戒指，安德华拉诺特，格劳堡王子之剑，工匠的学徒长袍\n\n> 殛夢整理，koko指正"
      }
    ]
  },
  "updateTimeSamp": 1624443457392
}